asaftg/seeker-bench/firmware/mmw_demoDDM_patched/dss_cm4/dss_cm4.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AWR2X44P" --part "Default" --package "LOP" --context "m4ss0-1" --product "MCU_PLUS_SDK_AWR2X44P@10.00.00"
 * @v2CliArgs --device "AWR2944P" --package "FCCSP (AMX)" --context "m4ss0-1" --product "MCU_PLUS_SDK_AWR2X44P@10.00.00"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const edma       = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1      = edma.addInstance();
const hwa        = scripting.addModule("/drivers/hwa/hwa", {}, false);
const hwa1       = hwa.addInstance();
const ipc        = scripting.addModule("/drivers/ipc/ipc");
const clock      = scripting.addModule("/kernel/dpl/clock");
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
edma1.$name                             = "CONFIG_EDMA0";
edma1.instance                          = "EDMA_DSS_A";
edma1.edmaRmDmaCh[0].$name              = "CONFIG_EDMA_RM0";
edma1.edmaRmDmaCh[0].resourceType       = scripting.forceWrite("ownDmaCh");
edma1.edmaRmDmaCh[0].startIndex         = 0;
edma1.edmaRmQdmaCh[0].$name             = "CONFIG_EDMA_RM1";
edma1.edmaRmQdmaCh[0].startIndex        = 0;
edma1.edmaRmTcc[0].$name                = "CONFIG_EDMA_RM2";
edma1.edmaRmTcc[0].startIndex           = 0;
edma1.edmaRmParam[0].$name              = "CONFIG_EDMA_RM3";
edma1.edmaRmParam[0].startIndex         = 0;
edma1.edmaRmReservedDmaCh[0].$name      = "CONFIG_EDMA_RM4";
edma1.edmaRmReservedDmaCh[0].startIndex = 0;
edma1.edmaRmReservedDmaCh[0].endIndex   = 0;

hwa1.$name = "CONFIG_HWA0";

ipc.vringNumBuf  = 1;
ipc.vringMsgSize = 1152;
ipc.intrPriority = 5;

mpu_armv71.$name      = "CONFIG_MPU_REGION0";
mpu_armv71.attributes = "Device";

mpu_armv72.$name      = "CONFIG_MPU_REGION1";
mpu_armv72.baseAddr   = 0x88000000;
mpu_armv72.attributes = "NonCached";
mpu_armv72.size       = 22;

mpu_armv73.$name        = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr     = 0x80800000;
mpu_armv73.size         = 19;
mpu_armv73.attributes   = "NonCached";
mpu_armv73.allowExecute = false;
